<?php

/**
 * Created by PhpStorm.
 * User: Zanyar Abdolahzadeh
 * Date: 3/14/2017
 * Time: 2:33 AM
 */

add_filter( 'woocommerce_states', 'LogitoWoocommerceIRStates' );
function LogitoWoocommerceIRStates( $states ) {
	$states['IR'] = array(
		'1'  => 'تهران',
		'2'  => 'گیلان',
		'3'  => 'آذربایجان شرقی',
		'4'  => 'خوزستان',
		'5'  => 'فارس',
		'6'  => 'اصفهان',
		'7'  => 'خراسان رضوی',
		'8'  => 'قزوین',
		'9'  => 'سمنان',
		'10' => 'قم',
		'11' => 'مرکزی',
		'12' => 'زنجان',
		'13' => 'مازندران',
		'14' => 'گلستان',
		'15' => 'اردبیل',
		'16' => 'آذربایجان غربی',
		'17' => 'همدان',
		'18' => 'کردستان',
		'19' => 'کرمانشاه',
		'20' => 'لرستان',
		'21' => 'بوشهر',
		'22' => 'کرمان',
		'23' => 'هرمزگان',
		'24' => 'چهارمحال و بختیاری',
		'25' => 'یزد',
		'26' => 'سیستان و بلوچستان',
		'27' => 'ایلام',
		'28' => 'کهگیلویه و بویراحمد',
		'29' => 'خراسان شمالی',
		'30' => 'خراسان جنوبی',
		'31' => 'البرز'
	);

	setlocale( LC_COLLATE, 'fa_IR.utf8' );
	asort($states['IR']);

	return $states;
}